Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_МаркаАвтомобиляИзСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_МодельАвтомобиляИзСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_ГодАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_ГосНомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_VINАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура АС_МаркаАвтомобиляПриИзменении(Элемент)

	АС_ЗаполнитьНаименованиеПоАвтомобилю();

КонецПроцедуры

&НаКлиенте
Процедура АС_МаркаАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Ожидание = Ложь;
	ДанныеВыбора = АС_ПолучитьАвтомобилиДляАвтоПодбора(Текст, Истина);

КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура АС_ПриОткрытииПосле(Отказ)

	АС_СкрытьЭлемент("СрокДоговора");
	АС_СкрытьЭлемент("ВидДоговора");
	АС_СкрытьЭлемент("Родитель");
	АС_СкрытьЭлемент("КатегорияДоговора");
	АС_СкрытьЭлемент("СтатьяДДСПоУмолчанию");
	АС_СкрытьЭлемент("СпособВыставленияДокументов");
	АС_СкрытьЭлемент("ДобавлениеДопРеквизитов");
	АС_СкрытьЭлемент("НомерДоговора");
	АС_СкрытьЭлемент("ЗаголовокДанныеОрганизации");
	АС_СкрытьЭлемент("БанковскийСчетПоУмолчанию");
	АС_СкрытьЭлемент("ГруппаДатаОтгрузки");
	АС_СкрытьЭлемент("ГруппаДатаОплаты");
	АС_СкрытьЭлемент("ГруппаВзаиморасчеты");
	АС_СкрытьЭлемент("ГруппаЦенообразование");

КонецПроцедуры


&НаКлиенте
Процедура АС_СкрытьЭлемент(ИмяЭлемента)

	ЭлементФормы = Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АС_МодельАвтомобиляПриИзменении(Элемент)

	АС_ЗаполнитьНаименованиеПоАвтомобилю();

КонецПроцедуры

&НаКлиенте
Процедура АС_МодельАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Ожидание = Ложь;
	ДанныеВыбора = АС_ПолучитьАвтомобилиДляАвтоПодбора(
		Текст, Ложь, Объект.АС_МаркаАвтомобиляИзСправочника);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьАвтомобилиДляАвтоПодбора(Текст, ЭтоМарка, Родитель = Неопределено)

	Результат = Новый СписокЗначений;
	Если ПустаяСтрока(СокрЛП(Текст))
		ИЛИ (НЕ ЭтоМарка И НЕ ЗначениеЗаполнено(Родитель)) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 20
		| Автомобили.Ссылка КАК Ссылка,
		| Автомобили.Наименование КАК Наименование
		|ИЗ
		| Справочник.АС_Автомобили КАК Автомобили
		|ГДЕ
		| Автомобили.ЭтоГруппа = &ЭтоГруппа
		| И НЕ Автомобили.ПометкаУдаления
		| И (Автомобили.Наименование ПОДОБНО &СтрокаПоиска
		|  ИЛИ Автомобили.АС_Синонимы ПОДОБНО &СтрокаПоиска)";

	Если НЕ ЭтоМарка Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС
			+ " И Автомобили.Родитель = &Родитель";
		Запрос.УстановитьПараметр("Родитель", Родитель);
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + Символы.ПС
		+ "УПОРЯДОЧИТЬ ПО Автомобили.Наименование";
	Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоМарка);
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СокрЛП(Текст) + "%");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура АС_ГосНомерАвтомобиляПриИзменении(Элемент)

	АС_ЗаполнитьНаименованиеПоАвтомобилю();

КонецПроцедуры

&НаКлиенте
Процедура АС_VINАвтомобиляПриИзменении(Элемент)

	Объект.АС_VINАвтомобиля = ВРег(Объект.АС_VINАвтомобиля);

КонецПроцедуры

&НаКлиенте
Процедура АС_ЗаполнитьНаименованиеПоАвтомобилю()

	Если НЕ ЗначениеЗаполнено(Объект.АС_МаркаАвтомобиляИзСправочника)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.АС_МодельАвтомобиляИзСправочника)
		ИЛИ ПустаяСтрока(СокрЛП(Объект.АС_ГосНомерАвтомобиля)) Тогда
		Возврат;
	КонецЕсли;

	Марка = СокрЛП(Строка(Объект.АС_МаркаАвтомобиляИзСправочника));
	Модель = СокрЛП(Строка(Объект.АС_МодельАвтомобиляИзСправочника));
	ГосНомер = ВРег(СокрЛП(Объект.АС_ГосНомерАвтомобиля));

	Объект.АС_ГосНомерАвтомобиля = ГосНомер;
	Объект.Наименование = Марка + " " + Модель + " | " + ГосНомер;

КонецПроцедуры
